app/controllers/contacts_controller.rb

	def create
		@contact = Contact.new(contact_params)

		if @contact.save
---
INSERT INTO "contacts" ("name", "number", "desription", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Danil"], ["number", "098 123 33 43"], ["desription", "contact information"], ["created_at", "2019-09-03 10:30:16.856956"], ["updated_at", "2019-09-03 10:30:16.856956"]]

	def index
		@contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

	def edit
		@contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@contact = Contact.find(params[:id])
		if @contact.update(contact_params)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "desription" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["desription", "contact informationasd"], ["updated_at", "2019-09-03 11:00:15.463969"], ["id", 1]]

	def show
		@contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def destroy
		@contact = Contact.find(params[:id])
		if @contact.destroy
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 6]]